#include"functions.h"

/*
Описати структуру з іменем «MARSHRUT», що містить наступні поля :
«Назва пукту відправлення маршруту»;
«Назва пукту призначення маршруту»;
«Номер маршруту».
Написати програму для реалізації таких дій :
А).Ввід даних в масив структур типу « MARSHRUT « та сортування
записів по зростанню номера маршруту;
Б).Вивід інформації про маршрут, номер якого задається користувачем;
В).Вивід інформації про маршрути, які починаються або закінчуються в
пункті, назву якого задає користувач;
Якщо таких маршрутів немає, — вивести відповідне повідомлення.
*/
int main()
{
	int n = input();
	MARSHRUT *arr = new MARSHRUT[n];
	arrInput(arr, n);
	choise(arr, n);
	return 0;
}